#undef NDEBUG
#include <cstdio>
#include <cstdint>
#include <cstdlib>
#include <cstring>
#include <climits>
#include <cassert>
#include <climits>
#include <cstdarg>
#include <cctype>
#include <cinttypes>

#include <map>
#include <set>
#include <chrono>
#include <utility>
#include <vector>
#include <memory>
#include <string>
#include <algorithm>
#include <unordered_set>

#include "utf8.h"
#include "bitcode.h"
#include "format.h"
#include "hashmap.h"

using namespace std::chrono;

using string = std::string;
template <typename T> using vector = std::vector<T>;
template <typename T> using set = std::set<T>;
template <typename K,typename V> using pair = std::pair<K,V>;
template <typename K,typename V> using map = std::map<K,V>;
template <typename T, typename H> using hash_set = std::unordered_set<T,H>;
typedef unsigned int uint;

static const char* blocks_file = "data/unicode/Blocks.txt";
static const char* data_file = "data/unicode/UnicodeData.txt";
static const char* search_data;
static bool optimized_search = true;
static bool print_data = false;
static bool print_blocks = false;
static bool debug_symbols = false;
static bool debug_tree = false;
static bool debug_flat = false;
static bool debug_comments = false;
static bool compress_stats = false;
static bool experiment = false;
static bool compress_data = false;
static bool help_text = false;

static vector<string> split(string str,
    string sep, bool inc_sep, bool inc_empty)
{
    size_t i, j = 0;
    vector<string> comps;
    while ((i = str.find_first_of(sep, j)) != string::npos) {
        if (inc_empty || i - j > 0) comps.push_back(str.substr(j, i - j));
        if (inc_sep) comps.push_back(str.substr(i, sep.size()));
        j = i + sep.size();
    }
    if (inc_empty || str.size() - j > 0) {
        comps.push_back(str.substr(j, str.size() - j));
    }
    return comps;
}

static vector<string> split(string str,
    string exc_sep, string inc_sep)
{
    size_t h, i, j = 0;
    vector<string> comps;
    while (true) {
        h = str.find_first_of(exc_sep, j);
        i = str.find_first_of(inc_sep, j);
        if (h == string::npos && i == string::npos) break;
        if (h != string::npos && (i == string::npos || h < i)) {
            if (h - j > 0) comps.push_back(str.substr(j, h - j));
            j = h + 1; /* assumes separator is 1-byte */
        } else {
            comps.push_back(str.substr(j, i - j + 1));
            j = i + 1; /* assumes separator is 1-byte */
        }
    }
    if (str.size() - j > 0) {
        comps.push_back(str.substr(j, str.size() - j));
    }
    return comps;
}

static string join(vector<string> comps,
    string sep, size_t start, size_t end)
{
    string str;
    for (size_t i = start; i != end; i++) {
        if (i != start) {
            str.append(sep);
        }
        str.append(comps[i]);
    }
    return str;
}

static std::string ltrim(std::string s)
{
    s.erase(s.begin(), std::find_if(s.begin(), s.end(), [](unsigned char ch) {
        return !std::isspace(ch);
    }));
    return s;
}

static std::string rtrim(std::string s)
{
    s.erase(std::find_if(s.rbegin(), s.rend(), [](unsigned char ch) {
        return !std::isspace(ch);
    }).base(), s.end());
    return s;
}

struct block {
    uint start;
    uint end;
    string name;
};

vector<block> read_blocks()
{
    // # @missing: 0000..10FFFF; No_Block
    // 0000..007F; Basic Latin
    vector<block> blocks;
    FILE *f;
    char buf[128];
    const char* p;

    if ((f = fopen(blocks_file, "r")) == nullptr) {
        fprintf(stderr, "fopen: %s\n", strerror(errno));
        exit(1);
    }
    while((p = fgets(buf, sizeof(buf), f)) != nullptr) {
        auto l = ltrim(rtrim(string(p)));
        if (l.size() == 0) continue;
        if (l.find("#") != string::npos) continue;
        size_t d = l.find("..");
        size_t s = l.find(";");
        blocks.push_back({
            (uint)strtoul(l.substr(0,d).c_str(),nullptr, 16),
            (uint)strtoul(l.substr(d+2,s-d-2).c_str(),nullptr, 16),
            l.substr(s+2)
        });
    }
    fclose(f);

    return blocks;
}

uint find_block(vector<block> &blocks, uint32_t cp)
{
    uint i = 0;
    for (auto &b: blocks) {
        if (cp >= b.start && cp <= b.end) return i;
        i++;
    }
    return blocks.size()-1;
}

void do_print_blocks()
{
    vector<block>  blocks = read_blocks();
    for (auto &b : blocks) {
        printf("%04u-%04u %s\n", b.start, b.end, b.name.c_str());
    }
}

enum class General_Category
{
    Lu, /* Letter, Uppercase */
    Ll, /* Letter, Lowercase */
    Lt, /* Letter, Titlecase */
    Lm, /* Letter, Modifier */
    Lo, /* Letter, Other */
    Mn, /* Mark, Nonspacing */
    Mc, /* Mark, Spacing Combining */
    Me, /* Mark, Enclosing */
    Nd, /*  Number, Decimal Digit */
    Nl, /* Number, Letter */
    No, /* Number, Other */
    Pc, /* Punctuation, Connector */
    Pd, /* Punctuation, Dash */
    Ps, /* Punctuation, Open */
    Pe, /* Punctuation, Close */
    Pi, /* Punctuation, Initial quote */
    Pf, /* Punctuation, Final quote */
    Po, /* Punctuation, Other */
    Sm, /* Symbol, Math */
    Sc, /* Symbol, Currency */
    Sk, /* Symbol, Modifier */
    So, /* Symbol, Other */
    Zs, /* Separator, Space */
    Zl, /* Separator, Line */
    Zp, /* Separator, Paragraph */
    Cc, /* Other, Control */
    Cf, /* Other, Format */
    Cs, /* Other, Surrogate */
    Co, /* Other, Private Use */
    Cn, /* Other, Not Assigned */
};

enum Canonical_Combining_Class {
    Not_Reordered        = 0,   /* Spacing and enclosing marks; also many vowel and consonant signs, even if nonspacing */
    Overlay              = 1,   /* Marks which overlay a base letter or symbol */
    Han_Reading          = 6,   /* Diacritic reading marks for CJK unified ideographs */
    Nukta                = 7,   /* Diacritic nukta marks in Brahmi-derived scripts */
    Kana_Voicing         = 8,   /* Hiragana/Katakana voicing marks */
    Virama               = 9,   /* Viramas */
    Ccc10                = 10,  /* Start of fixed position classes */
    Ccc199               = 199, /* End of fixed position classes */
    Attached_Below_Left  = 200, /* Marks attached at the bottom left */
    Attached_Below       = 202, /* Marks attached directly below */
    Attached_Above       = 214, /* Marks attached directly above */
    Attached_Above_Right = 216, /* Marks attached at the top right */
    Below_Left           = 218, /* Distinct marks at the bottom left */
    Below                = 220, /* Distinct marks directly below */
    Below_Right          = 222, /* Distinct marks at the bottom right */
    Left                 = 224, /* Distinct marks to the left */
    Right                = 226, /* Distinct marks to the right */
    Above_Left           = 228, /* Distinct marks at the top left */
    Above                = 230, /* Distinct marks directly above */
    Above_Right          = 232, /* Distinct marks at the top right */
    Double_Below         = 233, /* Distinct marks subtending two bases */
    Double_Above         = 234, /* Distinct marks extending above two bases */
    Iota_Subscript       = 240, /* Greek iota subscript only */
};

enum class Bidi_Class
{
    L,   /* Left-to-Right */
    LRE, /* Left-to-Right Embedding */
    LRO, /* Left-to-Right Override */
    R,   /* Right-to-Left */
    AL,  /* Right-to-Left Arabic */
    RLE, /* Right-to-Left Embedding */
    RLO, /* Right-to-Left Override */
    PDF, /* Pop Directional Format */
    EN,  /* European Number */
    ES,  /* European Number Separator */
    ET,  /* European Number Terminator */
    AN,  /* Arabic Number */
    CS,  /* Common Number Separator */
    NSM, /* Non-Spacing Mark */
    BN,  /* Boundary Neutral */
    B,   /* Paragraph Separator */
    S,   /* Segment Separator */
    WS,  /* Whitespace */
    ON,  /* Other Neutrals */

    LRI, /* Left-to-Right Isolate */
    FSI, /* First Strong Isolate */
    PDI, /* Pop Directional Isolate */
    RLI, /* Right-to-Left Isolate */
};

/*
 * Decomposition_Type Examples:
 *
 *   0041 0300      (A WITH GRAVE)
 *   0041 0301      (A WITH ACUTE)
 *   <circle> 0030  (CIRCLED DIGIT ZERO)
 */

static const char* Decomposition_Types[] = {
    "",
    "<font>",
    "<noBreak>",
    "<initial>",
    "<medial>",
    "<final>",
    "<isolated> ",
    "<circle>",
    "<super>",
    "<sub>",
    "<vertical>",
    "<wide>",
    "<narrow>",
    "<small>",
    "<square>",
    "<fraction>",
    "<compat>",
    nullptr,
};

enum {
    DT_none,      /* No tag. */
    DT_font,      /* A font variant (e.g. a blackletter form). */
    DT_noBreak,   /* A no-break version of a space or hyphen. */
    DT_initial,   /* An initial presentation form (Arabic). */
    DT_medial,    /* A medial presentation form (Arabic). */
    DT_final,     /* A final presentation form (Arabic). */
    DT_isolated,  /*  An isolated presentation form (Arabic). */
    DT_circle,    /* An encircled form. */
    DT_super,     /* A superscript form. */
    DT_sub,       /* A subscript form. */
    DT_vertical,  /* A vertical layout presentation form. */
    DT_wide,      /* A wide (or zenkaku) compatibility character. */
    DT_narrow,    /* A narrow (or hankaku) compatibility character. */
    DT_small,     /* A small variant form (CNS compatibility). */
    DT_square,    /* A CJK squared font variant. */
    DT_fraction,  /* A vulgar fraction form. */
    DT_compat,    /* Otherwise unspecified compatibility character. */
};

/*
 * Decomposition_Mapping
 * Numeric_Type
 *
 * 0-9
 */

/*
 * Numeric_Value
 *
 * 5000
 * -1/2
 * 5/12
 */

enum Bidi_Mirrored
{
    BM_N,
    BM_Y,
};

/*
 * Simple_Uppercase_Mapping
 * Simple_Lowercase_Mapping
 * Simple_Titlecase_Mapping
 *
 * [0-9A-F]+     (codepoint)
 */


struct data {
    /*  0 */ uint32_t Code;
    /*  1 */ string Name;
    /*  2 */ string General_Category;
    /*  3 */ string Canonical_Combining_Class;
    /*  4 */ string Bidi_Class;
    /*  5 */ string Decomposition_Type;
    /*  6 */ string Decomposition_Mapping;
    /*  7 */ string Numeric_Type;
    /*  8 */ string Numeric_Value;
    /*  9 */ string Bidi_Mirrored;
    /* 10 */ string Unicode_1_Name;
    /* 11 */ string ISO_Comment;
    /* 12 */ string Simple_Uppercase_Mapping;
    /* 13 */ string Simple_Lowercase_Mapping;
    /* 14 */ string Simple_Titlecase_Mapping;
};

/*
 * compression
 */

enum type_enum {
    type_code,
    type_inner,
    type_leaf,
} ;

struct token_node;

union data_union {
    struct {
        size_t code;
        token_node* node;
    } code;
    struct {
        token_node* left;
        token_node* right;
    } inner;
    struct {
        size_t symbol;
    } leaf;

    data_union(size_t code, token_node* node) : code{code, node} {}
    data_union(token_node *left, token_node *right) : inner{left, right} {}
    data_union(size_t symbol) : leaf{symbol} {}
};

struct token_node
{
    type_enum type;
    data_union u;
    size_t node_id;
    bool visited;
};

struct token_set
{
    map<string,size_t> prefix_hist;
    map<size_t,size_t> char_hist;

    size_t next_node_id;
    vector<token_node*> codepoints;
    map<string,token_node*> memo;
    vector<string> symbols;

    static token_node* new_root(size_t code, token_node *node)
    {
